{
  "lesson": {
    "id": 23
  },
  "lessonOverview": {
    "title": "Unit 3 - Lesson 7",
    "topic": "Unit Test & Video",
    "resources": {
      "studentBook": {
        "pages": "",
        "activities": []
      },
      "activityBook": {
        "pages": "",
        "activities": []
      },
      "phonicsBook": {
        "pages": "",
        "activities": []
      },
      "homework": null,
      "materials": [
        "Unit 3 Project Gallery",
        "Unit 3 Video"
      ]
    },
    "vocabulary": [],
    "structures": [],
    "phonics": []
  },
  "lessonOutcomes": [
    {
      "outcome": "Students can listen and name fruits and vegetables mentioned in a short audio.",
      "category": "Communication",
      "supportStrategies": [
        "(Listening) Play the listening text. Say: “Listen for the fruit and vegetables.” Students circle what they hear in their SB."
      ],
      "stretchStrategies": [
        "Turn the video review into a “Freeze and Speak” game. Play the video and freeze it at any scene. Students describe what’s happening."
      ]
    },
    {
      "outcome": "Students can say what we need to plant seeds and what happens after we water them.",
      "category": "Real world learning",
      "supportStrategies": [
        "(Science) Draw the seed→plant process on the board. Use simple phrases: “plant seed,” “add water,” “sun grows it.” Repeat with students."
      ],
      "stretchStrategies": [
        "Turn the video review into a “Freeze and Speak” game. Play the video and freeze it at any scene. Students describe what’s happening."
      ]
    },
    {
      "outcome": "Students can work in pairs to choose fruits and vegetables for a class farm and draw or label them.",
      "category": "Future Skills",
      "supportStrategies": [
        "(4Cs – Planning) Give groups a paper square and ask: “What will you grow?” Students draw and label a simple farm together."
      ],
      "stretchStrategies": [
        "Turn the video review into a “Freeze and Speak” game. Play the video and freeze it at any scene. Students describe what’s happening."
      ]
    }
  ],
  "languageTransferAnalysis": [
    {
      "section": "1. Plural nouns:",
      "items": [
        "Hai con chó >> two dog [two dogs]. Not only the form, but the pronunciation is tough here, as it changes depending on the final sound of the noun [s,z,iz]"
      ]
    },
    {
      "section": "2. Unstressed vowels (schwa):",
      "items": [
        "Unstressed vowels do not really exist in Vietnamese, so these need extra practice. Make sure the final vowel of computer is a light schwa, not a heavy com-pu-TER. Same with the final vowel of banana. Or the second syllable of elephant. And so on."
      ]
    },
    {
      "section": "3. Released final consonants:",
      "items": [
        "In Vietnamese, final consonants are 'held in' – you don't actually hear them released. But in English, the final consonant of cat, top, rock, and so on are released with a puff of air. Make sure you are aware of this difference."
      ]
    },
    {
      "section": "4. Plural forms of it is and there is:",
      "items": [
        "Plural forms of these structures do not exist in Vietnamese. It's difficult for kids to remember to produce them, particularly because the plural element comes before the noun phrase. There are two houses"
      ]
    },
    {
      "section": "5. Vowels with multiple sounds (phonics mismatch):",
      "items": [
        "Phonics introduces each vowel with one sound, which quickly breaks down past the Kindergarten 2 level. Think of the es in elephant or the as in banana. This does not happen in Vietnamese, where every vowel is pronounced as written."
      ]
    },
    {
      "section": "6. Food:",
      "items": [
        "Food in syllabi typically Western-centric; banh mi >> bread"
      ]
    }
  ],
  "lessonPlan": null
}