{
  "lesson": {
    "id": 23
  },
  "lessonOverview": {
    "title": "Unit 3 - Lesson 7",
    "topic": "Unit Test & Video",
    "resources": {
      "studentBook": {
        "pages": "",
        "activities": []
      },
      "activityBook": {
        "pages": "",
        "activities": []
      },
      "phonicsBook": {
        "pages": "",
        "activities": []
      },
      "homework": null,
      "materials": [
        "Unit 3 Project Gallery",
        "Unit 3 Video"
      ]
    },
    "vocabulary": [],
    "structures": [],
    "phonics": []
  },
  "lessonOutcomes": [
    {
      "outcome": "Students can listen to a video and answer comprehension questions about food in space.",
      "category": "Communication",
      "supportStrategies": [
        "(Listening) Play video in parts. Ask: “What can they eat?” Students answer on mini whiteboards or by ticking images in the SB."
      ],
      "stretchStrategies": [
        "Students work in groups to design a “Class Astronaut Menu” with 4–5 foods. They explain their choices using target language, then compare menus to vote on the best one."
      ]
    },
    {
      "outcome": "Students can explain why astronauts eat different types of food in space.",
      "category": "Real world learning",
      "supportStrategies": [
        "(Science) Ask: “Why can’t they eat bread in space?” Students list foods they think work in space, then compare with video answers."
      ],
      "stretchStrategies": [
        "Students work in groups to design a “Class Astronaut Menu” with 4–5 foods. They explain their choices using target language, then compare menus to vote on the best one."
      ]
    },
    {
      "outcome": "Students can share their opinions politely and discuss why astronauts eat differently in space.",
      "category": "Future Skills",
      "supportStrategies": [
        "(4Cs – Critical Thinking) Group task: “Design an astronaut lunchbox.” What’s inside? Why? Each group shares their ideas and explains their choices."
      ],
      "stretchStrategies": [
        "Students work in groups to design a “Class Astronaut Menu” with 4–5 foods. They explain their choices using target language, then compare menus to vote on the best one."
      ]
    }
  ],
  "languageTransferAnalysis": [
    {
      "section": "1. Food:",
      "items": [
        "Food in syllabi typically Western-centric: banh mi >> bread"
      ]
    },
    {
      "section": "2. Plural nouns:",
      "items": [
        "Hai con chó >> two dog [two dogs]. Not only the form, but the pronunciation is tough here, as it changes depending on the final sound of the noun [s,z,iz]"
      ]
    },
    {
      "section": "3. Unstressed vowels (schwa):",
      "items": [
        "Unstressed vowels do not really exist in Vietnamese, so these need extra practice. Make sure the final vowel of computer is a light schwa, not a heavy com-pu-TER. Same with the final vowel of banana. Or the second syllable of elephant. And so on."
      ]
    },
    {
      "section": "4. Released final consonants:",
      "items": [
        "In Vietnamese, final consonants are 'held in' – you don't actually hear them released. But in English, the final consonant of cat, top, rock, and so on are released with a puff of air. Make sure you are aware of this difference."
      ]
    },
    {
      "section": "5. Contractions:",
      "items": [
        "Do not exist in standard Vietnamese, written or spoken. The hardest part for YLs is learning to pronounce them naturally: there's a dog rather than there is a dog."
      ]
    }
  ],
  "lessonPlan": null
}